Revit 2027 API
ParameterValuePresenceRule.Parameter Property
 The parameter which will be evaluated to pass this rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId Parameter { get; set; }
Public Property Parameter As ElementId
	Get
	Set
public:
property ElementId^ Parameter {
	ElementId^ get ();
	void set (ElementId^ value);
}
member Parameter : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ParameterValuePresenceRule Class
Autodesk.Revit.DB Namespace